# custom_yolov12n.yaml
# Arquitectura ficticia inspirada en YOLOv8, extendida para mayor capacidad
# 7 clases personalizadas

nc: 7  # número de clases
anchors: 3
depth_multiple: 0.50  # más profundidad que yolov8n (era 0.33)
width_multiple: 0.33  # más ancho que yolov8n (era 0.25)

backbone:
  [[-1, 1, Conv, [64, 3, 2]],     # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 4, C2f, [128, True]],     # más capas C2f
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 6, C2f, [512, True]],
   [-1, 1, Conv, [768, 3, 2]],    # 7-P5/32 (más ancho)
   [-1, 3, C2f, [768, True]],
   [-1, 1, SPPF, [768, 5]]
  ]

head:
  [[-1, 1, Conv, [384, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [384]],

   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C2f, [192]],

   [-1, 1, Conv, [192, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C2f, [384]],

   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C2f, [768]],

   [[17, 20, 23], 1, Detect, [nc]]
  ]
